Revit 2027 API
BuiltInFailures.DimensionFailures.LockOverconstrainedAlignment Property
 Locking this alignment would overconstrain the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LockOverconstrainedAlignment { get; }
Public Shared ReadOnly Property LockOverconstrainedAlignment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LockOverconstrainedAlignment {
	FailureDefinitionId^ get ();
}
static member LockOverconstrainedAlignment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace